export const coffees = [
  {
    "title": "黑咖啡",
    "desc": "又称“清咖啡”，香港俗称“斋啡”、星马俗称“咖啡乌”，直接用咖啡豆烧制的咖啡，不添加奶、糖等会影响咖啡原味的饮用方式。速溶咖啡是不属于黑咖啡的范围的。",
    "img": "/images/black.jpg",
    "showDesc": false
  },
  {
    "title": "白咖啡",
    "desc": "马来西亚特产，起源于怡保镇，是指用黄油烘培的咖啡豆，冲煮后，加入甜炼乳的饮品。从本质上是一种拿铁咖啡。在美国，白咖啡也指轻度烘培的咖啡豆，使用意式冲煮，具有较强酸味的咖啡。",
    "img": "/images/white.jpg",
    "showDesc": false
  },
  {
    "title": "加味咖啡",
    "desc": "依据各地口味的不同，在咖啡中加入巧克力、糖浆、果汁、肉桂、肉豆蔻、橘子花等不同调料。",
    "img": "/images/add.jpg",
    "showDesc": false
  },
  {
    "title": "浓缩咖啡",
    "desc": "是一种通过迫使接近沸腾的高压水流通过磨成细粉的咖啡制作而成的饮料。",
    "img": "/images/nong.jpg",
    "showDesc": false
  },
  {
    "title": "拿铁咖啡",
    "desc": "“Caffè latte”为意大利文音译；拿铁咖啡又称“欧蕾咖啡”（Cafe au lait），法文音译─咖啡加上大量的热牛奶和糖。又称“咖啡牛奶”—中文释意，由一份浓缩咖啡加上两份以上的热牛奶。另也可依需求加上两份浓缩咖啡，称为“Double”。",
    "img": "/images/natie.jpg",
    "showDesc": false
  },
  {
    "title": "玛琪雅朵咖啡",
    "desc": "在浓缩咖啡上放上适量蒸汽打发奶泡。Macchiato意大利文原意便是“被牛奶弄脏的咖啡”。",
    "img": "/images/maqiduo.jpg",
    "showDesc": false
  },
  {
    "title": "美式咖啡",
    "desc": "浓缩咖啡加上大量热水。比普通的浓缩咖啡柔和。也可加冰饮用，风味独树一帜。",
    "img": "/images/meishi.jpg",
    "showDesc": false
  },
  {
    "title": "爱尔兰咖啡",
    "desc": "在咖啡中加入威士忌，顶部放上奶油。名字里就带着一阵威士忌浓烈的熏香，爱尔兰人视威士忌如生命，当然也会试图在咖啡中加入威士忌。以威士忌调成的爱尔兰咖啡，更能将咖啡的酸甜味道衬托出来。",
    "img": "/images/aierlan.jpg",
    "showDesc": false
  },
  {
    "title": "维也纳咖啡",
    "desc": "由奥地利马车夫爱因·舒伯纳发明，在咖啡中加入鲜奶油，并洒上糖制的七彩米。",
    "img": "/images/weiyena.jpg",
    "showDesc": false
  },
  {
    "title": "越南咖啡",
    "desc": "（越南语：cà phê đá／咖啡𥒥，字面意思为冰咖啡）是一种滴漏咖啡。加上牛奶，在北越称为越南冰牛奶咖啡（越南语：cà phê nâu đá），按其字面意思，就是冰咖啡加炼乳。因为热带气候影响，越南人相当喜欢喝冰咖啡。越南南方人称为“cà phê sữa đá”,意为“牛奶咖啡加冰”。",
    "img": "/images/yuenan.jpg",
    "showDesc": false
  },
  {
    "title": "冰咖啡",
    "desc": "咖啡中加奶泡、糖和冰块，口感微甜凉爽，几乎没有咖啡的苦涩味道，是适合夏季消暑的饮料。",
    "img": "/images/bing.jpg",
    "showDesc": false
  },
  {
    "title": "卡布奇诺",
    "desc": "卡布奇诺咖啡是意大利咖啡的一种变化，即在偏浓的咖啡上，倒入以蒸汽发泡的牛奶，此时咖啡的颜色就像卡布奇诺教会修士深褐色外衣上覆的头巾一样，咖啡因此得名。 拿铁咖啡其实也是意大利咖啡的一种变化，只是在咖啡、牛奶、奶泡的比例稍作变动为1：1：1即成。",
    "img": "/images/kabuqinuo.jpg",
    "showDesc": false
  },
  {
    "title": "康宝蓝",
    "desc": "只要在意大利浓缩咖啡中加入适量的鲜奶油，即轻松地完成一杯康宝蓝。嫩白的鲜奶油轻轻漂浮在深沉的咖啡上，宛若一朵出淤泥而不染的白莲花。 在意大利浓缩咖啡中，不加鲜奶油、牛奶，只加上两大勺绵密细软的奶泡就是一杯马琪雅朵。不像康宝蓝，要想享受马琪雅朵的美味，就要一口喝下。",
    "img": "/images/kangbaolan.jpg",
    "showDesc": false
  },
  {
    "title": "法国牛奶咖啡",
    "desc": "咖啡和牛奶的比例为1：1，正统的法国牛奶咖啡冲泡时，要牛奶壶和咖啡壶从两旁同时注入咖啡杯，这种冲配方法延续了几百年。今天，它仍是法国人餐桌上不可或缺的饮品。",
    "img": "/images/faguo.jpg",
    "showDesc": false
  },
  {
    "title": "土耳其咖啡",
    "desc": "至今仍采用原始煮法，复杂的工艺带着几许异国情调的神秘色彩。从中，我们可以窥视到奥斯曼帝国盛极一时的风采。",
    "img": "/images/tuerqi.jpg",
    "showDesc": false
  },
  {
    "title": "莫卡咖啡",
    "desc": "在其中加入巧克力就可以调成香浓的摩卡咖啡。",
    "img": "/images/moka.jpg",
    "showDesc": false
  },
  {
    "title": "皇家咖啡",
    "desc": "这一道极品是由一位能征贯战的皇帝发明的，蓝色的火焰舞起白兰地的芳醇与方糖的焦香，再合上浓浓的咖啡香，苦涩中略带甘甜。",
    "img": "/images/huangjia.jpg",
    "showDesc": false
  },
  {
    "title": "冰拿铁咖啡",
    "desc": "利用果糖与牛奶混合增加牛奶的比重，使它与比重较轻的咖啡不会混合，成为黑白分明的两层，形成如鸡尾酒般曼妙的视觉效果，再加上冰块，即可饮用。",
    "img": "/images/bingnatie.jpg",
    "showDesc": false
  },
  {
    "title": "阿芙佳朵",
    "desc": "在冰凉的香草冰淇淋上倒入意大利浓缩咖啡，再用巧克力酱在鲜奶油和冰淇淋上自由构图，魔力般水乳交融的冰品咖啡，只留芳香与清爽在你口中。",
    "img": "/images/affogato.jpg",
    "showDesc": false
  },
]

export const effect = [
  {
    title: "蔗糖：",
    desc: "烘培过程中部分会热裂解为甲酸、醋酸、乳酸、甘醇酸，故含糖量愈高的生豆，在浅培时会愈酸,可增加咖啡香气复杂度；部分会在过程中经过焦糖化反应而变为焦糖，可增加咖啡风味。"
  },
  {
    title: "咖啡因：",
    desc: "略带苦味，熔点高达237℃，因此烘培好的咖啡熟豆，其咖啡因几乎完整保留下来，并在萃取时会融入杯中。咖啡因的作用主要是刺激中枢神经系统、心脏和呼吸系统。适量的咖啡因亦可减轻肌肉疲劳，促进消化液分泌。由于它会促进肾脏机能，有利尿作用，帮助体内将多余的钠离子排出体外。但摄取过多会导致咖啡因中毒。"
  },
  {
    title: "绿原酸：",
    desc: "浅培至中培(一爆至二爆中)，约有50%的绿原酸会降解为奎宁酸(酸涩)，而咖啡亦是人类摄取绿原酸的主要来源。"
  },
  {
    title: "脂肪：",
    desc: "其中最主要的是酸性脂肪及挥发性脂肪。\n 酸性脂肪：即脂肪中含有酸，其强弱会因咖啡种类不同而异。\n 挥发性脂肪：是咖啡香气主要来源，会散发出约四十种芳香物质。 "
  },
  {
    title: "蛋白质：",
    desc: "蛋白质在烘培过程中会与糖类参与梅纳反应(美拉德反应)，进而产生令人沉醉其中的复杂香气。"
  },
  {
    title: "纤维：",
    desc: "占咖啡熟豆的70%，不可被萃取出来。"
  },
  {
    title: "矿物质：",
    desc: "含有少量石灰、铁质、磷、碳酸钠等。"
  },
]

export const cook = [
  {
    title: "磨制",
    children: [
      {
        title: "研磨",
        desc: "将烘焙好的豆子研磨成粉的过程，主要分为手磨和电磨两种，用陶瓷或金属磨盘给予的压力使之破碎成粉。研磨的方法产出的咖啡末比较均匀，在烹制的时候出味也比较一致。研磨部件可以是圆盘形或圆锥形。",
        list: [
          { title: "意式研磨：", desc: "为研磨中最细的一种研磨，常常需要专门的研磨机研磨，使用手磨研磨将十分费力费时。" },
          { title: "细研磨：", desc: "通常为手磨的最细度研磨，接近于细沙的粗细度。" },
          { title: "中细研磨：", desc: "介于中度研磨与细研磨之间，白砂糖粗细，通常为手冲常用的研磨度。" },
          { title: "中研磨：", desc: "比白砂糖略粗，直径在2mm以内。" },
          { title: "粗研磨：", desc: "大于2mm的研磨，在实际的冲煮过程中很少用到。" },
        ]
      },
      { title: "打磨", desc: "多数现代机器实际上是在每分钟两万到三万转的高速下把咖啡豆切成碎末（有的人干脆用打浆机）。这类刀片式打磨机的耗件寿命要长一些；但是打磨中积聚热量、制成的咖啡碎末大小不均，难以提炼出优质的饮品。这类打磨机理论上只能用于滴漏式咖啡壶。它们产生的尘粉会堵塞浓缩咖啡和French press机器中的滤网。" },
      { title: "臼磨", desc: "如果找不到好的研磨设备的话，您能做的只有使用一支捣杵和一座臼钵，“玉兔捣药”式的慢慢享受劳动的乐趣了。这种研磨方式容易粗细不匀，影响萃取效果。" }
    ]
  },
  {
    title: "萃取",
    children: [
      {
        title: "浸泡法",
        desc: "",
        list: [
          { desc: "法式压滤机（French press）是一个高瘦的玻璃圆筒，配一个带滤器的活塞。热水和咖啡末在圆筒中泡上四到七分钟，然后由活塞滤器把咖啡末压到底部，上层的咖啡便可以倒出饮用。这种“完全浸入法”被很多专家认为是泡制咖啡的理想的家用方法。" },
          { desc: "冷泡咖啡：将研磨后的咖啡豆置于纱布内放入盛有冰水的玻璃瓶中，静止一夜即可。用冷水浸泡出的咖啡，比起一般的咖啡更加醇厚、但也有更多的咖啡因。冷泡咖啡制造原理很简单，就是经过较长的时间用冷水萃取出咖啡末，可以使用单一产地的咖啡豆并使研磨度介于意式与手冲之间。" }
        ]
      },
      {
        title: "煎煮法",
        desc: "土耳其咖啡是一个早期的方法，仍在中东、北非、东非、土耳其、希腊和巴尔干地区使用。超细的咖啡末加水在小口容器中煮开，一般加糖和豆蔻调味。盛在杯子里的浓咖啡上有泡沫，下有一层淤积的粉末。“牛仔咖啡”是把咖啡末加水直接在锅里煮开了饮用。这个名字暗示一个在简陋条件下的权宜之计；然而有人偏好此道。在咖啡人均消费最高的芬兰和瑞典，这是他们传统的烹制方法。"
      },
      {
        title: "循环法",
        desc: "用过滤式或蒸气方式冲泡咖啡时，咖啡末与沸水之间的接触只有一次，但以过滤循环式咖啡壶冲泡咖啡时，沸水可以数次循环的接触咖啡末，而表现出较香浓的咖啡味。使用过滤循环式咖啡壶时，先在壶中放置金属滤杯，接着将开水注于壶中，再把咖啡末倒入过滤杯内，于壶的下端加热，当壶中的开水沸腾后便会通过唯一出口的金属管上升，由于上端有盖子盖住，因此过滤杯中的咖啡液会下降而循环冲泡。"
      },
      {
        title: "滴滤法",
        desc: "将咖啡末置于一可透水容器内(上壶)，并放上滤纸以防止粉末滴入萃取好的咖啡液。 水与咖啡末接触的机会只有一次。 其萃取重点在于冲泡的手法、滤纸的形式、咖啡豆研磨的粗细、上壶的形状以及水温。"
      },
      {
        title: "虹吸法",
        desc: "其原理类似浸泡法，但差别在于萃取过程中仍有热源。 其器具需可上下壶对流并密闭。加热时产生蒸气压并把下壶的水推往上壶，而在过程中,下壶需持续受热以维持蒸气压，等萃取结束后停止受热，当下壶蒸气还原为液态时，就会将上壶的咖啡液吸回下壶。"
      },
      {
        title: "压力法",
        desc: "浓缩咖啡是由80～96摄氏度的热水以8～9个大气压的力道通过压实的咖啡末饼制成，时间约为20~30秒，通常一杯份只有30毫升。它是常见咖啡中最浓的之一，带有独特的香气和一抹油脂（pamsteam koirl）浮在表层。它可以单独饮用；也可以进一步制成多种其他饮品，意式咖啡的主要基底。由于冲煮快速，不少咖啡店或是调味咖啡都采用此法。"
      }
    ]
  },
  {
    title: "水种类的搭配",
    children: [
      {
        title: "软水",
        desc: "日本的自来水，尢其是矿泉水大多是矿物质含量较低的软水。由于矿物质成分较少，所以对咖啡的成分影响不大。在试饮的结果中，呈现出最为圆润的口感。"
      },
      {
        title: "中硬水",
        desc: "含有适量的钙质成分，介于软水和硬水峙间的水。从试饮的过程中和软水相比较之下，欠缺买滑感。但酸度和苦味适中，刺激感也降底到一定程度，可说是各方面都较为平衡的味道。"
      },
      {
        title: "硬水",
        desc: "产于欧洲等地的欧美矿泉水，大多都是硬水。水中含有与咖啡苦味较强，对经常熬夜工作需要咖啡提神的人，或是追求刺激口感的人来说是最好的选择。"
      },
    ]
  }
]